[
  {
    "type": "verb",
    "meanings": [
      {
        "definition": "to obtain, buy, or earn something: ",
        "examples": [
          "He went to the shop to get some milk.",
          "UK I think she gets about £40,000 a year.",
          " We stopped on the way to get some breakfast.",
          " I managed to get all three suitcases for under $200.",
          " How much did he get for his car? (= How much money did he sell it for?)",
          " Where did you get your shoes from?"
        ]
      },
      {
        "definition": "to receive or be given something: ",
        "examples": [
          "UK I got quite a surprise when I saw her with short hair.",
          " When did you get the news about Sam?",
          " I got a phone call from Phil last night.",
          " What grade did he get for the exam?",
          " I got the impression that they'd rather be alone.",
          " What did you get for your birthday?",
          " We don't get much snow (= it does not often snow) here.",
          " I managed to get a glimpse of him (= see him for a moment) through the crowds.",
          " If you get a moment (= have time available), could you help me fill in that form?",
          " She gets such pleasure from her garden.",
          " If you can get some time off work, we could finish the decorating.",
          " I can never get her to myself (= be alone with her) because she's always surrounded by people."
        ]
      },
      {
        "definition": "to go somewhere and bring back someone or something: ",
        "examples": [
          "Let me go get my glasses.",
          " [ + two objects ] Can I get you a drink?"
        ]
      },
      {
        "definition": "to take someone or something into your possession by force: ",
        "examples": [
          "Have the police got the man who did it yet?",
          " Your cat got a bird this morning!"
        ]
      },
      {
        "definition": "to reach or arrive at a particular place: ",
        "examples": [
          "We hadn't even got as far as London when the car broke down.",
          " What time does he normally get home (from work)?",
          " If you get to the restaurant before us, just wait at the bar."
        ]
      },
      {
        "definition": "to reach a particular stage, condition, or time: ",
        "examples": [
          "You earn loads of money if you get to the top in that profession.",
          " It got to Thursday and she still hadn't heard any news.",
          "informal I'm getting to the stage now where I just want to give up."
        ]
      },
      {
        "definition": "to make progress or to improve: ",
        "examples": [
          "She's taking flute lessons, but she really doesn't seem to be getting anywhere with it.",
          " It's been hard settling in, but I feel like I'm getting somewhere at last."
        ]
      },
      {
        "definition": "to become ill with a disease, virus, etc.: ",
        "examples": [
          "I got food poisoning at that cheap little seafood restaurant.",
          " Kids get all kinds of bugs at school."
        ]
      },
      {
        "definition": "to become or start to be: ",
        "examples": [
          "He gets really upset if you mention his baldness.",
          " Is your cold getting any better?",
          " Your coffee's getting cold.",
          " After a while you get used to all the noise.",
          " You're getting to be such a big boy, aren't you!",
          " [ + to infinitive ] How did you get to be a belly dancer?"
        ]
      },
      {
        "definition": "to start to go or move: ",
        "examples": ["We'd better get moving or we'll be late."]
      },
      {
        "definition": "to cause something to happen, or cause someone or something to do something: ",
        "examples": [
          "[ + adj ] She had to get the kids ready for school.",
          " [ + past participle ] I'm trying to get this article finished by Thursday.",
          " We get our groceries delivered.",
          " [ + -ing verb ] Were you able to get the copy machine working?",
          " [ + to infinitive ] I can't get my computer to work!"
        ]
      },
      {
        "definition": "to persuade someone to do something: ",
        "examples": ["Why don't you get Nicole to come to the party?"]
      },
      {
        "definition": "to do something to something or someone without intending to or by accident: ",
        "examples": [
          "He got his bag caught in the train doors as they were closing.",
          " I always get the two youngest sisters' names confused."
        ]
      },
      {
        "definition": "sometimes used instead of \"be\" to form the passive: ",
        "examples": [
          "I got shouted at by some idiot for walking past his house.",
          " They're getting married later this year.",
          " This window got broken."
        ]
      },
      {
        "definition": "to move to a different place or into a different position: ",
        "examples": [
          "I hit my head as I was getting into the car.",
          " Get out of here now or I'll call the police.",
          " The bed is too wide - we'll never get it through the door.",
          " Getting up the ladder was easy enough - it was coming down that was the problem.",
          " He got down on his knees and asked me to marry him!"
        ]
      },
      {
        "definition": "to travel somewhere in a train, bus, or other vehicle: ",
        "examples": ["Shall we get a taxi to the station?"]
      },
      {
        "definition": "to deal with or answer a ringing phone, knock on the door, etc.: ",
        "examples": [
          "Hey, Ty, someone's at the door - would you get it, please?"
        ]
      },
      {
        "definition": "to have the chance to do something: ",
        "examples": [
          "I never get to see her now that she works somewhere else."
        ]
      },
      {
        "definition": "to understand or hear something: ",
        "examples": [
          "I didn't get what he said because the music was so loud.",
          " I told that joke to Sophia, but she didn't get it."
        ]
      },
      {
        "definition": "to prepare a meal: ",
        "examples": [
          "I'll put the kids to bed while you're getting dinner ready."
        ]
      },
      {
        "definition": "to pay for something: ",
        "examples": ["Put your money away - I'll get these drinks."]
      },
      {
        "definition": "to confuse someone and make them completely unable to understand or explain: ",
        "examples": ["Give him a technical question - that'll really get him!"]
      },
      {
        "definition": "something that you say when you do not know the answer to a question: ",
        "examples": ["\"How many ounces in a kilo?\" \"You've got me there.\""]
      },
      {
        "definition": "to annoy someone: ",
        "examples": [
          "It really gets to me the way we're expected to actually laugh at his pathetic jokes!"
        ]
      },
      {
        "definition": "to make someone feel strongly emotional and often cry: ",
        "examples": [
          "That part in the film when he finds out that his daughter is alive - that always gets me!"
        ]
      },
      {
        "definition": "to hit someone, especially with a bullet or something thrown: ",
        "examples": ["The bullet got her in the leg."]
      }
    ]
  },
  {
    "type": "verb",
    "meanings": [
      {
        "definition": "to take something into your possession, or have something happen that you accept or receive: ",
        "examples": [
          "He climbed over the fence to get his ball back.",
          " Monique raised her hand to get the teacher’s attention.",
          " Can I get you a drink?",
          " Dad keeps telling me to get a job.",
          " What did you get on the test (= What mark did you receive)?",
          " I think she gets (= earns) about $10 an hour.",
          " We don’t get much snow in this part of the country (= It does not often snow)."
        ]
      },
      {
        "definition": "To get something often means to buy or pay for it: ",
        "examples": ["He went to the store to get milk."]
      },
      {
        "definition": "to become or start to be: ",
        "examples": [
          "Your coffee is getting cold.",
          " He’s gotten so big, I hardly recognized him.",
          " They’re getting married later this year.",
          " Tom got lost in the woods.",
          " What time do you get off work?",
          " We’d better get going/moving or we’ll be late."
        ]
      },
      {
        "definition": "to become ill with a disease: ",
        "examples": ["Everyone seems to be getting the flu."]
      },
      {
        "definition": "to cause something to be done or persuade someone to do something: ",
        "examples": [
          "The bed is too wide – we’ll never get it through the door.",
          " I can’t get this printer to work!"
        ]
      },
      {
        "definition": "to prepare a meal: ",
        "examples": ["Why don’t you get supper ready?"]
      },
      {
        "definition": "to move in a particular direction: ",
        "examples": [
          "[ I ] Get away from that wet paint!",
          " [ I ] He got down on his hands and knees to look for his contact lens.",
          " [ T ] Her throat was so sore that she had trouble getting the medicine down (= swallowing it).",
          " [ I ] I hit my head as I was getting into the car.",
          " [ M ] Momma said we have to get these wet clothes off (= remove them).",
          " [ T ] Get your feet off the couch (= move them off it)."
        ]
      },
      {
        "definition": "To get off a road when you are driving means to turn onto another road: ",
        "examples": ["[ I ] Get off the expressway at exit 43."]
      },
      {
        "definition": "To get off a train, bus, or aircraft is to leave it: ",
        "examples": ["[ I ] Get off at Union Station."]
      },
      {
        "definition": "to go into a vehicle or aircraft for traveling: ",
        "examples": ["We could call for a taxi or get the bus."]
      },
      {
        "definition": "to arrive at a place or reach a stage in a process: ",
        "examples": [
          "We only got as far as Denver when the car broke down.",
          " What time does he normally get home from work?",
          " We’re not getting very far (= not advancing) with this computer program, are we?"
        ]
      },
      {
        "definition": "to understand: ",
        "examples": [
          "I think I got the general idea of the chapter.",
          " The music was loud and I didn’t get what he said.",
          " I never said he was mean – you’ve got it all wrong (= you are confused about this matter)."
        ]
      },
      {
        "definition": "to calculate the answer to a mathematical problem: ",
        "examples": ["What do you get if you divide 20 by 4?"]
      },
      {
        "definition": "to answer a ringing telephone, a knock at the door, etc.: ",
        "examples": [
          "Hey, Juan, someone’s at the door – would you get it, please?"
        ]
      },
      {
        "definition": "to hit someone, esp. with something thrown or a bullet: ",
        "examples": [
          "My first throw missed, but the second got him in the leg."
        ]
      },
      {
        "definition": "to cause someone to feel slightly angry: ",
        "examples": [
          "It gets me when I have to both cook dinner and clean the dishes."
        ]
      },
      {
        "definition": "to have an emotional effect on someone: ",
        "examples": [
          "That scene in the movie, when the father and daughter are reunited, always gets me."
        ]
      }
    ]
  },
  {
    "type": "verb",
    "meanings": [
      {
        "definition": "to obtain, buy, or earn something: ",
        "examples": [
          "I think she gets about $40,000 a year.",
          "get sth for sth How much did he get for his business when he sold it?"
        ]
      },
      {
        "definition": "to receive or be given something: ",
        "examples": [
          "get sth from sb/sth The results we got from our market research team indicate that potential customers seem to like the new ad campaign."
        ]
      },
      {
        "definition": "to reach a particular stage, condition, or time: ",
        "examples": [
          "get to sth Your earnings increase hugely if you get to the top in the legal profession."
        ]
      },
      {
        "definition": "to pay for something: ",
        "examples": ["I'll get the bill. "]
      }
    ]
  }
]
